*** Label Formatting Function

#+begin_src R
shrink <- function(input) {
  parts <- str_split(input, "x", simplify=T)
  if (parts[1] == parts[2]) {
    str_c(parts[1], "$^2$", collapse="")
  } else {
    input
  }
}

format <- function(input) {
  str_flatten(map(str_split(input, "_", simplify=T), shrink), collapse="\n")
}

format_vec <- function(input) {
  str_replace_all(input, "_", "\n")
}

format_vec(c("10x10_2x2", "12x12_3x3"))
#+end_src

#+RESULTS:
|     x |
|-------|
| 10x10 |
|   2x2 |
| 12x12 |
|   3x3 |

*** DONE Cycle count
CLOSED: [2023-03-29 Wed 10:03]
:LOGBOOK:
- State "DONE"       from "WAITING"    [2023-03-29 Wed 10:03]
:END:

#+header: :width 650 :height 300

#+header: :width 6.85 :height 2.85
#+begin_src R :results graphics output file :file cycles-performance.tikz
data <- full_join(
  read_csv("data/diospyros.csv"),
  read_csv("data/est_cycles.csv")
)

to_face <- function(sat) {
  map_chr(sat, function(x) {
    if (x == "yes") {
      "black"
    } else {
      "red"
    }  
  })
}

faces <- data %>%
  filter(kernel == "dios") %>%
  select(saturated) %>%
  mutate(
    bold=to_face(saturated)
  )

data <- data %>%
  ## filter(benchmark == "2d-conv" | benchmark == "mat-mul") %>%
  select(benchmark, params, kernel, cycles) %>%
  group_by(benchmark) %>%
  pivot_wider(
    names_from=kernel,
    values_from=cycles
  ) %>%
  mutate(
    benchmark=recode(benchmark,
                     "qr-decomp"="QrD",
                     "2d-conv"="2DC",
                     "mat-mul"="MM",
                     "q-prod"="QP"
                     ),
    name = str_c(
      str_replace_all(str_replace_all(params, "x", "$\\\\times$"), "_", "\n"),
      "\n",
      benchmark
    ),
    norm = naive.fixed,
    compgen = norm / compgen,
    dios = norm / dios,
    nature = norm / nature,
    naive = norm / naive,
    naive.fixed = norm / naive.fixed,
    naive.clang = norm / naive.clang,
  ) %>%
  pivot_longer(
    cols = c("naive.fixed", "naive.clang", "nature", "dios", "compgen"),
    names_to = "kernel",
    values_to = "cycles"
  ) %>%
  select(name, kernel, cycles)

data %>%
  group_by(benchmark) %>%
  ggplot(aes(
    xmin=as.numeric(factor(name, levels=unique(name))) - 0.35,
    xmax=as.numeric(factor(name, levels=unique(name))) + 0.35,
    ymin=0,
    ymax=cycles,
    fill=factor(kernel, levels=unique(kernel))
  )) +
  geom_rect(
    position="dodge",
    color="black",
  ) +
  geom_hline(yintercept=1, linetype="solid", color="black") +
  labs(y="Speed up over Naive (fixed size)", fill="Compiler") +
  scale_x_continuous(
    label=unique(data$name),
    breaks=1:length(unique(data$name))
  ) +
  scale_y_continuous(
    trans="log2"
  ) +
  scale_fill_brewer(
    palette = "Paired",
    labels=c(
      "Naive",
      "Naive (vectorized)",
      "Nature",
      "Diospyros",
      "Compgen"
    )
  ) +
  theme_minimal() +
  theme(
    axis.title.x = element_blank(),
    axis.title.y = element_text(size=8, face="bold"),

    axis.text.x = element_text(size=5, color="black"),
    axis.text.y = element_text(size=8, color="black"),

    legend.position = "top",
    legend.background = element_blank(),
    legend.text = element_text(size=7, face="bold"),
    legend.title = element_blank(),
    legend.key.size = unit(0.75, "lines"),
    legend.box.spacing = unit(0, "lines"), 
    legend.margin = margin(0, 0, 2, 0),

    panel.spacing.x = unit(0, "lines"),

    strip.placement = "outside"
  )
#+end_src

#+RESULTS:
[[file:cycles-performance.tikz]]

#+begin_src R :session cycest
data <- full_join(full_join(
  read_csv("data/stock_cycles.csv"),
  read_csv("data/est_cycles.csv")
  %>% filter(timeout == "180")
  %>% filter(params != "18x18_2x2")
  %>% filter(params != "18x18_3x3")
  %>% filter(params != "18x18_4x4")
  %>% filter(params != "18x18_18x18")
  %>% filter(params != "20x20_20x20")
), read_csv("data/noeqsat.csv"))

data %>% filter(kernel == "nature" | kernel == "compgen") %>%
  select(kernel, benchmark, params, cycles) %>%
  pivot_wider(
    names_from=kernel,
    values_from=cycles
  ) %>%
  mutate(
    speedup=nature / compgen 
  ) %>% summarise(mean = mean(speedup, na.rm = T), n = n())
#+end_src

#+RESULTS:
|             mean |  n |
|------------------+----|
| 3.27463214032345 | 21 |

** Instruction Ablation

#+header: :file instruction.tex

#+header: :results output 

#+begin_src R 
data <- read_csv("data/instruction.csv", show_col_types=F, progress=F) %>%
  filter(benchmark == "qr-decomp") %>%
  mutate(
    muls=if_else(rules == "muls" | rules == "ruleset", "MULS", "No MULS"),
    mulsgn=if_else(rules == "mulsgn" | rules == "ruleset", "MulSgn", "No MulSgn"),
    speedup=round(1229 / cycles, 2)*100,
    show=if_else(speedup >= 100, str_c("+", speedup-100, "%"), str_c("-", 100-speedup, "%"))
  ) %>%
  select(muls, mulsgn, show) %>%
  print(n=10) %>%
  pivot_wider(names_from=c(muls), values_from=show) %>%
  mutate(` `=mulsgn) %>%
  select(` `, `MULS`, `No MULS`)

## print(xtable(
##   data,
##   caption=str_c(
##     "Cycle estimates for QR-Decomp for all",
##     " combinations of including MAC and MULS instructions."
##   )), include.rownames=FALSE)
#+end_src

#+RESULTS:
|           | MULS | No MULS |
|-----------+------+---------|
| MulSgn    |  +2% |     +0% |
| No MulSgn |  +2% |     +0% |

